use Lab7;

CREATE TABLE Table_uch1 (
    id int IDENTITY(1,1) NOT NULL,
    fio varchar(50) NOT NULL,
    predmet varchar(50) NOT NULL,
    ush varchar(50) NOT NULL,
    ball float NOT NULL
);

INSERT INTO Table_uch1 (fio, predmet, ush, ball) VALUES
('Иванова', 'математика', 'лицей', 98.5),
('Петров', 'физика', 'лицей', 99),
('Сидоров', 'математика', 'лицей', 88),
('Полухина', 'физика', 'гимназия', 78),
('Матвеева', 'химия', 'лицей', 92),
('Касимов', 'химия', 'гимназия', 68),
('Нестеров', 'математика', 'гимназия', 81),
('Авдеев', 'физика', 'лицей', 87),
('Никитина', 'химия', 'лицей', 94),
('Барышев', 'химия', 'лицей', 88);